/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "Stato"; /* Display Name */

"mQr54o" = "Sconosciuto";   /* Value: unknown */
"8K78Gu" = "Aperto";      /* Value: open */
"HSjTOt" = "Completato"; /* Value: completed */
"1Ncljt" = "Annullato";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Attività Things"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Titolo";     /* Property: title */
"Kw5NWX" = "Elenco";      /* Property: list */
"R3fuSz" = "Quando";      /* Property: when */
"8TjwzE" = "Sera";   /* Property: evening */
"gRh7no" = "No";        /* Property: evening (false value) */
"WHB5qC" = "Sì";       /* Property: evening (true value) */
"bww4JS" = "Promemoria";  /* Property: reminder */
"19lPBk" = "Scadenza";  /* Property: deadline */
"pp3qBd" = "Note";     /* Property: notes */
"UDIc1x" = "Elenco di controllo"; /* Property: checklist */
"KQzIKq" = "Etichette";      /* Property: tags */

/* TINList */

"x7Empa" = "Elenco Things"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Aggiungi attività"; /* Title */
"1Xn7Aa" = "Aggiunge una nuova attività in Things."; /* Description */

"YmSQDf" = "Attività"; /* Parameter: title */
"LHHz9E" = "Qual è il titolo?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "Elenco"; /* Parameter: list */
"X4r1DR" = "A quale elenco vuoi aggiungerla?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "Quando"; /* Parameter: when */
"VkNe0C" = "Quando vuoi iniziare?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "Sera"; /* Parameter: evening */
"b10WOZ" = "In serata?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "No"; /* Parameter: evening (false value) */
"KWUIrj" = "Sì"; /* Parameter: evening (true value) */

"AeXgbS" = "Ora del promemoria"; /* Parameter: reminderTime */
"3Nk1Yl" = "A che ora vuoi che te lo ricordi?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Scadenza"; /* Parameter: deadline */
"xi8sPe" = "Qual è la scadenza?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Etichette"; /* Parameter: tags */
"l0xizU" = "Quali etichette devono essere aggiunte?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "Stato"; /* Parameter: status */
"sS5Ms4" = "Qual è lo stato?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Modifica in Things"; /* Parameter: editInThings */
"W5N6Yo" = "Vuoi aprire Things per modificare questa attività?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "No"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Sì"; /* Parameter: editInThings (true value) */

"o8AABR" = "Note"; /* Parameter: notes */
"pjyLst" = "Quali note vuoi aggiungere?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Elenco di controllo"; /* Parameter: checklist */
"VIitBC" = "Quali elementi dell’elenco di controllo vuoi aggiungere?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} è stato aggiunto."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} è stato aggiunto."; /* Response Code: success (printed dialog) */
"sr1IRz" = "Si è verificato un errore durante l’aggiunta dell’attività."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "Si è verificato un errore durante l’aggiunta dell’attività."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "L’attività è stata aggiunta."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "L’attività è stata aggiunta."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "Titolo dell’attività"; /* Response Parameter: todoTitle */
"Br1Zm3" = "Attività"; /* Response Parameter: todo */

"9LylOv" = "Aggiungi ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "Aggiungi ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Mostra attività"; /* Title */
"JdIZ8x" = "Mostra l’attività specificata in Things."; /* Description */

"WAIq5F" = "Attività"; /* Parameter: todo */

"YIbDyi" = "Mostra ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Mostra elenco"; /* Title */
"xo5PDm" = "Mostra l’elenco specificato in Things."; /* Description */

"RW2Nyz" = "Elenco"; /* Parameter: list */
"V1nlDA" = "Quale elenco?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Filtra per etichette"; /* Parameter: filterByTags */
"HQ0TAS" = "Quali etichette?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "Mostra ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "Mostra ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "Mostra ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Esegui URL di Things"; /*  Title */
"keYeZ9" = "Esegue un URL di Things in background"; /*  Description */

"uPeA3l" = "URL Things"; /*  Parameter: url */
"oTrE0f" = "Quale URL ti serve?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "L’URL è stato eseguito con successo."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "L’URL è stato eseguito con successo."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "Si è verificato un errore nell’esecuzione dell’URL."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "Si è verificato un errore nell’esecuzione dell’URL."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Esegui URL Things ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Aggiungi attività"; /* Title */
"J4CdGj" = "Usa la funzione integrata per aggiungere attività a Things. Supporta solo una serie limitata di parametri."; /* Intent AddTasks -> Description */

"IF3OZi" = "Elenco attività"; /* Parameter: targetTaskList */
"uNB8yE" = "Titoli"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Apri Things"; /* Suggestions:  (title) */
